package com.example.user.newpet.dummy;

public class question {
    public String mquestions[]={
            "為什麼狗狗的鼻子總是濕濕的?",
            "天氣熱時是否要剪狗的毛?",
            "狗也會患上精神焦慮症和憂鬱症嗎?",
            "怎樣抱起你的貓 ?",
            "如何讓貓咪保持良好精神狀況?",
            "洗貓咪的重點?",
            "大概多久幫貓咪清一次耳朵?",
            "大概多久帶貓咪洗牙?",
            "貓咪不可以吃甚麼?",
            "貓咪可以吃甚麼?",
            "哪些植物不會傷害到貓?",
            "貓討厭的東西?",
            "養小狗要注意的事情?",
            "適合幼犬的食物?",
            "何者非養狗常見錯誤?",
            "貓狗皆無法食用的為何?",
            "養貓不用注意事項?",
            "養貓不常遇到的問題?",
            "養狗不需要準備的東西?",
            "養寵物不用考量的條件?",
            "訓練狗狗廁所的態度?",
            "養寵物不用負的責任?",
            "狗狗喜歡散步，想偷懶時應該如何?",
            "打預防針的時候沒有錢應該如何?",
            "自己能夠愛寵物的理由是甚麼?",
            "更加了解自己的狗的方式?",
            "可以餵幼犬喝生水嗎?",
            "狗驅蟲後還要餵藥片嗎?",
            "面對寵物過世時不應該如何?",
            "貓可以吃人的食物嗎?",
            "養很多隻貓時，貓砂盆建議多少個?",
            "貓咪跟狗狗一樣喜歡被人摸肚子嗎？",
            "為什麼貓咪會用臉頰去磨蹭家具？",
            "為什麼貓咪喜歡到處磨爪子？",
            "貓草跟貓薄荷一樣嗎？",
            "為什麼感覺貓咪特別容易嘔吐呢？",
            "狗可以分辨顏色嗎",
            "狗狗在害怕時會搖尾巴嗎？",
            "何者為評估好的獸醫院的條件?"

    };
    private String mchoice[][]={
            { "喝水沾到","經常過敏流鼻涕","狗舔鼻子，使細胞能接觸更多氣味分子，保持嗅覺靈敏",
                    "狗舔鼻子，使細胞能接觸更多氣味分子，以保持視覺靈敏"},

            {"不剪，經濟考量所以不剪","不剪，狗的汗腺主要分布在舌頭和腳掌，剪短沒幫助，會灼傷皮膚" ,
                    "剪，因為太熱會讓他們體溫過高而昏倒","剪，狗的汗腺主要分布在舌頭和身體上，剪短可以幫助舒暢"
            },

            { "會，因為狗的精神很敏感",
                    "不會，只要顧著吃跟睡","會，因為主人不工作很焦慮","不會，愛主人可以是快樂泉源"},

            {"一手放在牠的胸口位置，另一手放在牠的臀部，以支持重量，再將貓抱入臂彎","先抓住頭部，再抓住腳",
                    "一隻手放在牠的胸口位置，另一隻手放在牠的臀部，以支持重量，再將貓放上肩膀",
                    "雙手托住，再抱入懷中"},

            {"給他貓抓板","一起盪鞦韆","讓狗當他的新朋友","遛他"},

            {"頭部及耳朵盡量不要接觸水，等身體都洗完以後，再以毛巾擦拭頭部","頭部及耳朵需大量清水沖洗，再以毛巾擦全身",
                    "足部及耳鼻需大量清水沖洗","全身洗"},

            {"大約兩到三週一次","不用清","每天都要清","半年一次"},
            {"不洗","兩三年洗牙一次","每個月","半年一次"},
            {"貓草","貓罐頭","飼料","牛奶"},
            {"魚骨頭","巧克力","雞腿","貓薄荷"},
            {"蘆薈","地瓜葉","聖誕紅","黃金葛"},
            {"電線","塑膠袋","臭拖鞋","柚子味"},
            {"注重營養均衡","請吃雞腿","每天吃三餐","餵食牛奶"},
            {"鴨骨頭","專用飼料","雞肝","糕點"},
            {"趕快驅蟲","帶狗繩遛","經常幫狗洗澡","餓了就餵"},
            {"洋蔥","飼料","地瓜葉","罐頭"},
            {"每天清1～2次貓砂","健康檢查"," 經常洗澡","備留垂直空間"},
            {"掉毛","不甩人","半夜很嗨","很安靜"},
            {"外出牽引繩","梳子","玩具","恐龍"},
            {"經濟","住所","感情","數學成績"},
            {"不會尿送別人","趕他出去反省","打他","明確的教導"},
            {"愛他不棄養","愛別人的寵物","常常陪玩","一起享受時光"},
            {"偷懶，假裝自己養一隻偷懶的狗","生氣打他","還是帶他出去","餵食飼料"},
            {"嘗試向家人尋找援助","吃泡麵讓寵物打針","把寵物丟掉","不打針"},
            {"可愛就給他飯吃","很愛願意照顧他一輩子，無論生病疲倦與否","跟伴侶共養是愛的象徵","一時興起"},
            {"直觀相處","不了解沒關係","上網作功課","問養貓的人"},
            {"可以，反正是狗","不可以，而且水要放涼","可以，沒有差很多","不可以，要喝溫開水"},
            {"都可以","要，因為打針會沒效","不用，打針後無敵","要，因為狗會亂吃"},
            {"好好的面對將回憶珍藏在心中","出去跟朋友散心轉移注意力","適時找家人抒發","砸鄰居窗戶"},

            {"可以，讓貓一起吃便當","不行，貓不能吃太油膩的食物","可以，還可以餵牠吃魚","不行，貓只能吃老鼠"},

            {"貓數量加一" , "貓數量加二","都用同一個","每隻貓兩個"},

            {"不一定，因貓而異，有些貓喜歡摸背脊後半身，有些喜歡摸頭","喜歡，都可以摸", "不喜歡，那是貓的逆鱗", "不一定，不要摸最好"},
            {"因為貓咪覺得像摩擦人類", "因為想要摩擦", "貓臉頰有分泌費洛蒙的腺體構造，將自己的味道標記在物品上，是宣示主權的行為 "
           ,"因為臉很癢"},
            {"沒剪指甲就會一直磨",
                    "A貓的指間有腺體分泌費洛蒙，可在抓磨的位置標記自己的記號",
            "貓覺得很無聊",
       "貓覺得掌心癢癢才一直磨"},
            {"一樣，貓草就是貓薄荷",
    "貓薄荷是眾多種類貓草的其中一種，貓薄荷及木天蓼是常見的貓草種類之二",
    "不一樣，貓薄荷跟薄荷才是一樣",
            "貓草是貓薄荷的一種"},
            {"嘔吐是反射性動作，貓毛球可由此方式排出","常常吃太飽了所以嘔吐","其實貓在反芻","懷孕所以嘔吐"},
            {"可以，而且還有陰陽眼", "不行，狗只對紅色有反應","可以，而且比人類可以分辨的顏色還多","不行，狗是色盲"},
            {"會，表達激動的害怕","不會，他們會像夾著尾巴逃跑","會，搖尾巴向人求助", " 不會，他們會用往直前衝上去"},
            {"乾淨明亮的就醫環境"," 完善的儀器設施","獸醫師仔細的紀錄寵物病歷","以上皆是" }

};

    private String mcorrect[]={
            "狗舔鼻子，使細胞能接觸更多氣味分子，保持嗅覺靈敏",
            "不剪，狗的汗腺主要分布在舌頭和腳掌，剪短沒幫助，會讓陽光直接照射，灼傷皮膚",
            "會，因為狗的精神很敏感",
            "一手放在牠的胸口位置，另一手放在牠的臀部，以支持重量，再將貓抱入臂彎",
            "給他貓抓板",
            "頭部及耳朵盡量不要接觸水，等身體都洗完以後，再以毛巾擦拭頭部",
            "大約兩到三週一次",
            "兩三年洗牙一次",
            "牛奶",
            "貓薄荷",
            "地瓜葉",
            "柚子味",
            "注重營養均衡",
            "專用飼料",
            "帶狗繩遛",
            "洋蔥",
            " 經常洗澡",
            "很安靜",
            "恐龍",
            "數學成績",
            "明確的教導",
            "愛別人的寵物",
            "還是帶他出去",
            "嘗試向家人尋找援助",
            "很愛願意照顧他一輩子，無論生病疲倦與否",
            "上網作功課",
            "不可以，而且水要放涼",
            "要，因為狗會亂吃",
            "砸鄰居窗戶",
            "不行，貓不能吃太油膩的食物",
            "貓數量加一",
            "不一定，因貓而異，有些貓喜歡摸背脊後半身，有些喜歡摸頭",
            "貓臉頰有分泌費洛蒙的腺體構造，將自己的味道標記在物品上，是宣示主權的行為",
            "貓薄荷是眾多種類貓草的其中一種，貓薄荷及木天蓼是常見的貓草種類之二",
            "嘔吐是反射性動作，貓毛球可由此方式排出",
            "不行，狗是色盲",
            "不會，他們會像夾著尾巴逃跑",
            "以上皆是"
    };

    public String getquestion(int a){
        String question=mquestions[a];
        return question;
    }
    public String getchoice1(int a){ String choice=mchoice[a][0];
        return choice; }

    public String getchoice2(int a){ String choice=mchoice[a][1];
        return choice; }
    public String getchoice3(int a){ String choice=mchoice[a][2];
        return choice; }

    public String getchoice4(int a){ String choice=mchoice[a][3];
        return choice; }


    public String getcorrect(int a) {
        String answer = mcorrect[a];
        return answer;


    }


}
